{
  "_name_or_path": "allenai/scibert_scivocab_uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-absent",
    "2": "B-present",
    "3": "I-absent",
    "4": "I-present",
    "5": "B-hypothetical",
    "6": "B-possible",
    "7": "I-possible",
    "8": "I-hypothetical",
    "9": "B-conditional",
    "10": "I-conditional",
    "11": "B-associated_with_someone_else",
    "12": "I-associated_with_someone_else"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-absent": 1,
    "B-associated_with_someone_else": 11,
    "B-conditional": 9,
    "B-hypothetical": 5,
    "B-possible": 6,
    "B-present": 2,
    "I-absent": 3,
    "I-associated_with_someone_else": 12,
    "I-conditional": 10,
    "I-hypothetical": 8,
    "I-possible": 7,
    "I-present": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31090
}
