{
  "_name_or_path": "studio-ousia/luke-base",
  "architectures": [
    "LukeForEntityPairClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bert_model_name": "roberta-base",
  "bos_token_id": 0,
  "classifier_dropout": null,
  "entity_emb_size": 256,
  "entity_vocab_size": 500000,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "TeRP",
    "2": "PIP",
    "3": "TeCP",
    "4": "TrAP",
    "5": "TrIP",
    "6": "TrCP",
    "7": "TrWP",
    "8": "TrNAP"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "O": 0,
    "PIP": 2,
    "TeCP": 3,
    "TeRP": 1,
    "TrAP": 4,
    "TrCP": 6,
    "TrIP": 5,
    "TrNAP": 8,
    "TrWP": 7
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "luke",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.41.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "use_entity_aware_attention": true,
  "vocab_size": 50267
}
