{
  "add_prefix_space": false,
  "added_tokens_decoder": {
    "0": {
      "content": "<s>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "<pad>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "2": {
      "content": "</s>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "3": {
      "content": "<unk>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "50264": {
      "content": "<mask>",
      "lstrip": true,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "50265": {
      "content": "<ent>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "50266": {
      "content": "<ent2>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "additional_special_tokens": [
    "<ent>",
    "<ent2>",
    "<ent>",
    "<ent2>"
  ],
  "bos_token": "<s>",
  "clean_up_tokenization_spaces": true,
  "cls_token": "<s>",
  "entity_mask2_token": "[MASK2]",
  "entity_mask_token": "[MASK]",
  "entity_pad_token": "[PAD]",
  "entity_token_1": "<ent>",
  "entity_token_2": "<ent2>",
  "entity_unk_token": "[UNK]",
  "eos_token": "</s>",
  "errors": "replace",
  "mask_token": "<mask>",
  "max_entity_length": 2,
  "max_mention_length": 30,
  "model_max_length": 512,
  "pad_token": "<pad>",
  "sep_token": "</s>",
  "task": "entity_pair_classification",
  "tokenizer_class": "LukeTokenizer",
  "unk_token": "<unk>"
}
